Revit 2027 API
ParameterTypeId.StructuralAttachmentTopDistance Property
 "Top Attachment Distance"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId StructuralAttachmentTopDistance { get; }
Public Shared ReadOnly Property StructuralAttachmentTopDistance As ForgeTypeId
	Get
public:
static property ForgeTypeId^ StructuralAttachmentTopDistance {
	ForgeTypeId^ get ();
}
static member StructuralAttachmentTopDistance : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace